export interface IAboutItem {
  id: number;
  title: string;
  description: string;
  imageUrl: string;
  list?: string[];
}

export const aboutItems: IAboutItem[] = [
  {
    id: 1,
    title: "Чому ми тут",
    description:
      "Готелі не завжди стильні. Господарі не завжди надійні. Тому ми змінюємо правила гри — створюємо простори, що надихають і приносять радість, задовольняючи потреби без компромісів у стилі, при цьому забезпечуючи безперебійний, персоналізований досвід. Реєстрація, запит свіжих рушників, рекомендації щодо вечері — усе це доступно прямо з вашого телефону. Позбавляючись неефективностей у процесі зростання, ми можемо надавати гостинність, яка є водночас вражаючою та доступною. Адже кожен повинен мати змогу дозволити собі надзвичайне місце для проживання.",
    imageUrl: "/about/image_1.png",
  },
  {
    id: 2,
    title: "Як усе починалося",
    description:
      "Будучи студентом університету в Монреалі, наш співзасновник і генеральний директор Френсіс Девідсон почав керувати кількома квартирами. Він зустрічав гостей з вином, паркував їхні автомобілі та почав уявляти нові ідеали гостинності. Протягом наступних кількох літніх сезонів Френсіс експериментував з різними моделями, такими як поєднання мандрівників з вільними студентськими квартирами в різних містах та управління квартирами інших людей для короткострокової оренди. Через кілька років він разом зі співзасновником Мартіном Пікаром заклали основу, яка стала сьогоднішньою компанією hata.",
    imageUrl: "/about/image_2.png",
  },
  {
    id: 3,
    title: "Sonder сьогодні",
    description:
      "hata має кілька офісів по всьому світу, з головними містами в Денвері, Сан-Франциско, Монреалі та Лондоні/Амстердамі. Ми є дуже локально орієнтованою організацією, з командами на місцях у містах по всьому світу.",
    imageUrl: "/about/image_3.png",
    list: [
      "Понад 40 міст у 10 країнах",
      "Приблизно 9 000 активних одиниць по всьому світу",
      "Понад 1 мільйон гостей",
    ],
  },
];
