export interface IBlogItem {
  id: number;
  tag: string;
  title: string;
  description: string;
  imageBanner: string;
  imageBannerXL?: string;
  imageUrl: string;
  date?: string;
  time_read?: string;
  tag_link?: string;
  textContent?: ITextContent[];
  blog_title_QA?: string;
  blog_image_QA?: string;
  blog_qa?: IBlogQAItem;
  blog_image?: string[];
}

interface ITextContent {
  id: number;
  title: boolean;
  title_text?: string;
  text: string;
  image?: string;
}
export interface IBlogQAItem {
  favoriteCocktail: { question: string; answer: string };
  favoriteSpanishDish: { question: string; answer: string };
  drinkPreference: { question: string; answer: string };
  mealPreference: { question: string; answer: string };
  bestSunsetSpot: { question: string; answer: string };
  favoriteAfterShiftDrink: { question: string; answer: string };
  favoriteBeach: { question: string; answer: string };
  bestSnack: { question: string; answer: string };
  favoriteMarket: { question: string; answer: string };
  favoriteFestival: { question: string; answer: string };
  nightlifeDescription: { question: string; answer: string };
}

export const blogItems: IBlogItem[] = [
  {
    id: 1,
    tag: "Культура",
    title: "Тягне до Барселони? Знайомтесь — Педро з INSOLENT",
    description:
      "Літо наближається до Барселони, і ми прагнемо сонця, ковтків напоїв та найкращого з…",
    imageUrl: "/blog/blog_insolent/image01.png",
    imageBanner: "/blog/blog_insolent/imagebaner.png",
    imageBannerXL: "/blog/blog_insolent/blog_insolent_banner.png",
    date: "4  червня 2024 року",
    time_read: "3 хвилини читання",
    tag_link: "Барселона",
    textContent: [
      {
        id: 1,
        title: false,
        text: "Барселона зустрічає літо, і ми вже прагнемо сонця, напоїв та найкращих смаколиків міста. Щоб краще зануритися в гастросцену, ми звернулися до головного бармена та майстра гарного настрою Педро з INSOLENT у hata La Casa del Sol.",
      },
      {
        id: 2,
        title: false,
        text: "Мадридець, який переїхав до Барселони у вісімнадцять, Педро вирушив у мандри після навчання. Працював у найкращих барах і готелях Тенерифе та Майорки, а згодом повернувся до улюбленого міста — і до барної стійки INSOLENT. Людина балансу: якщо він не досліджує смаки міських районів, то блукає гірськими стежками навколо Барселони. Читайте далі — гарячі поради Педро та повна картина барів і ресторанів hata у Барселоні.",
      },
      {
        id: 3,
        title: true,
        text: "Що таке ресторан INSOLENT?",
      },
      {
        id: 4,
        title: false,
        text: "Витонченість, характер, якість. Кухня INSOLENT не піддається однозначному визначенню та сповнена веселощів — шефи Жуліа та Мікель заохочують «гратися з їжею». А до всього — «нестандартні» напої від Педро. Ресторан розташований у hata La Casa del Sol, а натхненням для нього слугує богемна атмосфера району Грасія з його яскравою індивідуальністю та «сільським» затишком.",
      },
    ],
    blog_title_QA: "60 секунд з Педро",
    blog_qa: {
      favoriteCocktail: {
        question: "Улюблений коктейль для приготування?",
        answer: "Bloody Mary — як робити, так і пити",
      },
      favoriteSpanishDish: {
        question: "Улюблена іспанська страва?",
        answer: "Крокети — але тільки за сімейним рецептом!",
      },
      drinkPreference: { question: "Сангрія чи кава?", answer: "Кава" },
      mealPreference: {
        question: "Тапас чи повноцінна вечеря?",
        answer: "Тапас",
      },
      bestSunsetSpot: {
        question: "Найкраще місце для перегляду заходу сонця в Барселоні?",
        answer: "Бункери в Кармелі",
      },
      favoriteAfterShiftDrink: {
        question: "Улюблений напій після зміни?",
        answer: "Дах Casa Luz",
      },
      favoriteBeach: {
        question: "Улюблений пляж у Барселоні?",
        answer: "Nova Icaria",
      },
      bestSnack: {
        question: "Найкраща закуска до напою?",
        answer: "Бар Bocata",
      },
      favoriteMarket: {
        question: "Улюблений місцевий ринок?",
        answer: "Mercat de la Concepció",
      },
      favoriteFestival: {
        question: "Улюблений фестиваль у Барселоні?",
        answer: "Primavera Sound",
      },
      nightlifeDescription: {
        question: "Одне слово, щоб описати нічне життя Барселони?",
        answer: "Затишне",
      },
    },
    blog_image_QA: "/blog/blog_insolent/blog_insolent_qa.png",
    blog_image: [
      "/blog/blog_insolent/blog_insolent1.png",
      "/blog/blog_insolent/blog_insolent2.png",
    ],
  },
  {
    id: 2,
    tag: "Подорожі",
    title: "П’ять захопливих подорожей на день по Лазурному узбережжю",
    description:
      "З відкриттям нашого нового напрямку, Канн, у нас виникає спокуса провести весь …",
    imageUrl: "/blog/image02.png",
    imageBanner: "",
  },
  {
    id: 3,
    tag: "Культура",
    title: "Паспорт гордості: наші фаворити сезону",
    description:
      "Червень вже не за горами, тому ознайомтеся з нашими найкращими …",
    imageUrl: "/blog/image03.png",
    imageBanner: "",
  },
  {
    id: 4,
    tag: "Подорожі",
    title: "Секрет hata: як провести 24 години у Флоренції",
    description:
      "hata їде до Флоренції цієї весни — і ми вважаємо, що вам варто приєднатися…",
    imageUrl: "/blog/image04.png",
    imageBanner: "",
  },
  {
    id: 5,
    tag: "Культура",
    title: "Секрет hata: як провести 24 години у Флоренції",
    description:
      "Готуєтеся до весняного чи осіннього дня перегонів? У нас є hata для вас…",
    imageUrl: "/blog/image05.png",
    imageBanner: "",
  },
  {
    id: 6,
    tag: "Культура",
    title: "Секрет hata: як провести 24 години у Флоренції",
    description:
      "hata Spotlight – це серія, присвячена деяким з наших улюблених (і талановитих!) гостей. У …",
    imageUrl: "/blog/image06.png",
    imageBanner: "",
  },
  {
    id: 7,
    tag: "Подорожі",
    title: "Сім причин відвідати Нідерланди навесні",
    description:
      "Щоб відсвяткувати запуск Sonder Rose у нашому новому місці призначення – Роттердамі, ми витрачаємо…",
    imageUrl: "/blog/image07.png",
    imageBanner: "",
  },
  {
    id: 8,
    tag: "Подорожі",
    title: "Секрет hata: як провести 24 години у Флоренції",
    description:
      "hata їде до Флоренції цієї весни — і ми вважаємо, що вам варто приєднатися…",
    imageUrl: "/blog/image08.png",
    imageBanner: "",
  },
  {
    id: 9,
    tag: "Подорожі",
    title: "П’ять захопливих подорожей на день по Лазурному узбережжю",
    description:
      "З відкриттям нашого нового напрямку, Канн, у нас виникає спокуса провести весь …",
    imageUrl: "/blog/image09.png",
    imageBanner: "",
  },
  {
    id: 10,
    tag: "Подорожі",
    title: "Нові простори Sonder у самому серці Единбурга",
    description:
      "Апарт-готель Sonder Royal Garden Apartments в Единбурзі розширився на 11 нових апартаментів, готових до бронювання. Ми раді зростати в самому серці цього історичного міста.",
    imageUrl: "/blog/image10.png",
    imageBanner: "",
  },
  {
    id: 11,
    tag: "Дизайн",
    title: "Представляємо нову креативну концепцію фотографії від Sonder",
    description:
      "Познайомтеся з нашим старшим креативним продюсером Отем Вуд та талановитим ...",
    imageUrl: "/blog/image11.png",
    imageBanner: "",
  },
  {
    id: 12,
    tag: "Дизайн",
    title: "Як затишно створити свій дім цієї зими",
    description:
      "Наша команда дизайнерів ділиться порадами щодо створення затишного та гостинного простору вдома цієї зими.",
    imageUrl: "/blog/image12.png",
    imageBanner: "",
  },
  {
    id: 13,
    tag: "Дизайн",
    title: "Три способи відчути святковий дух, не виходячи з дому",
    description:
      "Те, що ви застрягли вдома, не означає, що ви не можете відчути святковий дух! Ось три поради від наших дизайнерів, як зустріти свята, не встаючи з дивана.",
    imageUrl: "/blog/image13.png",
    imageBanner: "",
  },
  {
    id: 14,
    tag: "Дизайн",
    title: "Зробіть свою терасу місцем, де можна бути цього літа",
    description:
      "Барбекю, кавуни та біг через розбризкувачі. Ми всі хочемо витратити якомога більше…",
    imageUrl: "/blog/image14.png",
    imageBanner: "",
  },
  {
    id: 15,
    tag: "Дизайн",
    title: "Як створити (і підтримувати) власні мікроджунглі",
    description: "Кімнатні рослини, які зроблять ваш дім трохи кращим.",
    imageUrl: "/blog/image15.png",
    imageBanner: "",
  },
  {
    id: 16,
    tag: "Дизайн",
    title: "Поради щодо оновлення вашого житлового простору",
    description:
      "Літо близько! Ось як наша команда дизайнерів рекомендує освіжити ваш житловий простір.",
    imageUrl: "/blog/blog_upd_living/image16.png",
    imageBanner: "/blog/blog_upd_living/blog_upd_living1.png",
    imageBannerXL: "/blog/blog_upd_living/blog_upd_living1.png",
    blog_image: [
      "/blog/blog_upd_living/blog_upd_living1.png",
      "/blog/blog_upd_living/blog_upd_living2.png",
      "/blog/blog_upd_living/blog_upd_living3.png",
      "/blog/blog_upd_living/blog_upd_living4.png",
      "/blog/blog_upd_living/blog_upd_living5.png",
    ],
    textContent: [
      {
        id: 1,
        title: false,
        text: "Важливо виділяти час на оновлення наших житлових приміщень, оскільки ми проводимо так багато часу вдома. Коли ви живете в одних і тих самих кімнатах цілий рік, це може створювати відчуття клаустрофобії та посилювати монотонність локдауну. Невеликі покращення можуть допомогти розбавити місяці, проведені вдома, та створити так необхідну зміну обстановки.  Ми попросили нашу команду дизайнерів інтер'єрів дати поради щодо створення свіжого вигляду з настанням літа. Їхні поради наведені нижче.",
      },
      {
        id: 2,
        title: true,
        title_text: "Фарба - ",
        text: "це може здатися очевидним, але найшвидший спосіб перетворити простір – це змінити колір. Не обмежуйтеся чотирма кутами стіни – проявіть креативність у своєму застосуванні, продумавши стелі, оздоблення та двері.Ви можете додати індивідуальності кімнаті, створивши акцентну стіну з шпалер або фарби різних відтінків – це швидкий вихід, який допоможе обрамити кімнату та виділити весь простір. Не бійтеся грати з різними текстурами або робити щось сміливе – це створить ідеальний фокусний центр, який приверне увагу. ",
        image: "/blog/blog_upd_living/blog_upd_living2.png",
      },
      {
        id: 3,
        title: true,
        title_text: "Максимізуйте свій простір - ",
        text: "Якщо ви працюєте з вітальнею відкритого планування, розділіть кімнату на функціональні зони за допомогою килимів та перегородок, щоб уникнути втрати меблів. У Sonder ми любимо починати з великого килима, щоб закріпити кімнату, а потім переходити до меблів та аксесуарів. Або, якщо кімната, з якою ви працюєте, менша, ви можете створити враження більшого простору за допомогою кількох хитрих дизайнерських хитрощів. Панелі дуже популярні та можуть бути використані, щоб обдурити око, зробивши простір візуально більшим. Використовуйте вертикальні панелі, щоб привернути увагу вгору та створити враження вищих стель, або використовуйте горизонтальні панелі, щоб видовжити стіни. Це також додасть характеру та текстури вашій кімнаті. ",
        image: "/blog/blog_upd_living/blog_upd_living3.png",
      },
      {
        id: 4,
        title: true,
        title_text: "Зроби сам та перероби - ",
        text: "щоб ваша кімната виглядала оновленою, не потрібно все викидати та починати спочатку. Зміна кольору чогось може мати величезне значення, і це стосується також меблів. Коли ми успадковуємо нерухомість із існуючими предметами меблів, ми часто шукаємо креативні способи покращити ключові елементи, щоб вони краще відповідали нашому баченню та стилю. В одній з наших нерухомостей у Новому Орлеані ми нещодавно пофарбували меблі, щоб надати їм нового життя та призначення в нашому дизайні.",
        image: "/blog/blog_upd_living/blog_upd_living4.png",
      },
      {
        id: 5,
        title: true,
        title_text: "Максимізація світла - ",
        text: "створення враження світлої та просторої кімнати може відкрити простір та зробити його візуально більшим. Намагаючись збільшити кількість світла в кімнаті, подумайте про кольори, які ви використовуєте. Як правило, холодніші кольори відбиватимуть світло та створюватимуть враження більшого простору, тоді як темніші кольори та важкі текстури створять відчуття затишку. Ви також можете підкреслити природне освітлення за допомогою штор. Максимізуйте кількість світла, що потрапляє в кімнату, використовуючи подвійний карниз для штор з прозорою та непрозорою шторою. Це не тільки додасть кімнаті м'якості, але й дозволить вам блокувати світло, коли це необхідно, розсіюючи його протягом дня. Під час вішання штор ми завжди рекомендуємо кріпити карниз посередині між верхньою частиною вікна та стелею, щоб створити елегантний краєвид. Також переконайтеся, що кінці карниза виступають за межі віконної рами, щоб ви могли повністю відкрити штори, щоб впустити якомога більше світла. Ми любимо природне світло, але не всі простори мають великі вікна. Використовуючи штучне освітлення, ретельно вибирайте абажури, оскільки колір і тип матеріалу, з якого виготовлені світильники, можуть вплинути на рівень яскравості. Важчі, темніші матеріали можуть суттєво змінити рівень тепла в кімнаті, тому використовуйте їх економно та намагайтеся взагалі уникати, якщо працюєте в невеликому просторі, куди не потрапляє сонце.",
        image: "/blog/blog_upd_living/blog_upd_living5.png",
      },
      {
        id: 6,
        title: true,
        title_text: "Організуйте свій робочий простір з дому - ",
        text: "Підтримка порядку у вашому робочому просторі з дому є ключовою, а наявність місця для зберігання всіх речей може допомогти створити певний розмежування між роботою та домом. Упорядкуйте свої речі в невеликому кошику, щоб вони були легкодоступними протягом дня, але їх можна було прибрати вечорами та вихідними. Використання складної тканинної ширми для відокремлення простору також значно покращить акустику вашої наступної дзвінка в Zoom та допоможе контролювати рівень шуму. Якщо ви живете в невеликому просторі, не відчувайте себе змушеним постійно працювати в одному й тому ж місці! Подумайте про предмети, які можуть бути багатофункціональними. Похилі книжкові полиці можуть перетворитися на стоячі письмові столи, а легко пересувний журнальний столик може стати місцем для роботи на вулиці, якщо дозволяє погода.",
      },
    ],
    tag_link: "Дизайнерські хитрощі",
    date: "21  травня 2024 року",
    time_read: "5 хвилин читання",
  },
];
