interface ICommentItem {
  id: number;
  author: string;
  text: string;
}

export const commentItem: ICommentItem[] = [
  {
    id: 1,
    author: "Марина К., Київ",
    text: "«Ідеальне розташування та затишний інтер’єр. Було відчуття, ніби я вдома — тільки краще.»",
  },
  {
    id: 2,
    author: "Олексій П., Харків",
    text: "«Відмінна альтернатива готелю — просторо, стильно і все під рукою. Особливо сподобався безконтактний заїзд.»",
  },
  {
    id: 3,
    author: "Анна і Дмитро, Львів",
    text: "«Обирали для медового місяця — і не пошкодували. Тихо, романтично, і навіть краще, ніж на фото.»",
  },
  {
    id: 4,
    author: "Марина К., Київ",
    text: "«Ідеальне розташування та затишний інтер’єр. Було відчуття, ніби я вдома — тільки краще.»",
  },
  {
    id: 5,
    author: "Олексій П., Харків",
    text: "«Відмінна альтернатива готелю — просторо, стильно і все під рукою. Особливо сподобався безконтактний заїзд.»",
  },
  {
    id: 6,
    author: "Анна і Дмитро, Львів",
    text: "«Обирали для медового місяця — і не пошкодували. Тихо, романтично, і навіть краще, ніж на фото.»",
  },
];
